In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pandas import Series, DataFrame
%matplotlib inline
''' pandas is like numpy, Series is 1-dim dictionary, 
DataFrame is 2-dim - like a database frame'''

' pandas is like numpy, Series is 1-dim dictionary, \nDataFrame is 2-dim - like a database frame'

# Object Creation

In [2]:
values = range(1, 4)
labels = ['Cashews', 'Almonds', 'Peanuts']
s = Series(values, labels)
print s

Cashews    1
Almonds    2
Peanuts    3
dtype: int64

In [3]:
s2 = Series([1, 3, 5, np.nan, 6, 8])
s2

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [4]:
print s.index
print s.values
print type(s.values)

print zip(labels, values)
d = dict(zip(labels, values))
print d
Series(d)

Index([u'Cashews', u'Almonds', u'Peanuts'], dtype='object')
[1 2 3]
<type 'numpy.ndarray'>
[('Cashews', 1), ('Almonds', 2), ('Peanuts', 3)]
{'Almonds': 2, 'Peanuts': 3, 'Cashews': 1}

Almonds    2
Cashews    1
Peanuts    3
dtype: int64

In [5]:
print 'first level inside a list is row'
print pd.DataFrame([3, 4]) 
print 'second level inside a list is column'
print pd.DataFrame([[3, 4]])

first level inside a list is row
   0
0  3
1  4
second level inside a list is column
   0  1
0  3  4

In [5]:
df = DataFrame(np.arange(1, 10).reshape(3, 3), index = ['a', 'b', 'c'], columns = labels)
print df['Cashews']
df

a    1
b    4
c    7
Name: Cashews, dtype: int64

   Cashews  Almonds  Peanuts
a        1        2        3
b        4        5        6
c        7        8        9

In [6]:
dates = pd.date_range("20140101", periods = 6)
print dates
df2 = DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df2

DatetimeIndex(['2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04',
               '2014-01-05', '2014-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-04  0.249337 -1.102670  0.694883 -0.526755
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748
2014-01-06 -1.309757  0.259838 -0.193535  0.585470

In [7]:
df3 = DataFrame({'A': 1., 'B': pd.Timestamp('20140102'), 
                 'C': Series(1, index = list(range(4)), 
                             dtype = 'float32'), 
                 'D': np.array([3] * 4, dtype = 'int32'), 
                 'E': 'foo'})
print df3
print df3.dtypes
#df3.<tab>

   A          B  C  D    E
0  1 2014-01-02  1  3  foo
1  1 2014-01-02  1  3  foo
2  1 2014-01-02  1  3  foo
3  1 2014-01-02  1  3  foo
A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object

## Viewing Data

In [8]:
df3

   A          B  C  D    E
0  1 2014-01-02  1  3  foo
1  1 2014-01-02  1  3  foo
2  1 2014-01-02  1  3  foo
3  1 2014-01-02  1  3  foo

In [9]:
print df3.head(1)
print df3.tail(3)
print '----------------'
print df['Cashews'].head
print type(df['Cashews'])
print '----------------'
aa = df.Cashews
print aa
print aa['a']

   A          B  C  D    E
0  1 2014-01-02  1  3  foo
   A          B  C  D    E
1  1 2014-01-02  1  3  foo
2  1 2014-01-02  1  3  foo
3  1 2014-01-02  1  3  foo
----------------
<bound method Series.head of a    1
b    4
c    7
Name: Cashews, dtype: int64>
<class 'pandas.core.series.Series'>
----------------
a    1
b    4
c    7
Name: Cashews, dtype: int64
1

In [10]:
print df2.index # index column
print df2.columns # column
print df2.values
df2

DatetimeIndex(['2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04',
               '2014-01-05', '2014-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)
Index([u'A', u'B', u'C', u'D'], dtype='object')
[[ 0.55205223 -1.3391522   1.89480639  0.4117869 ]
 [-0.6980462   0.93889064 -0.05064274 -0.2081193 ]
 [ 0.57861741 -0.39172338 -0.22654593  0.24718122]
 [ 0.24933671 -1.10266956  0.69488323 -0.52675532]
 [-1.32398702 -1.0673794  -0.9130802  -1.00074806]
 [-1.30975731  0.25983777 -0.19353454  0.58546965]]

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-04  0.249337 -1.102670  0.694883 -0.526755
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748
2014-01-06 -1.309757  0.259838 -0.193535  0.585470

In [11]:
df2.describe() # R summary

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.325297 -0.450366  0.200981 -0.081864
std    0.896938  0.898221  0.975280  0.609182
min   -1.323987 -1.339152 -0.913080 -1.000748
25%   -1.156830 -1.093847 -0.218293 -0.447096
50%   -0.224355 -0.729551 -0.122089  0.019531
75%    0.476373  0.096947  0.508502  0.370635
max    0.578617  0.938891  1.894806  0.585470

In [12]:
df2.T # transpose

   2014-01-01  2014-01-02  2014-01-03  2014-01-04  2014-01-05  2014-01-06
A    0.552052   -0.698046    0.578617    0.249337   -1.323987   -1.309757
B   -1.339152    0.938891   -0.391723   -1.102670   -1.067379    0.259838
C    1.894806   -0.050643   -0.226546    0.694883   -0.913080   -0.193535
D    0.411787   -0.208119    0.247181   -0.526755   -1.000748    0.585470

### Sort

In [13]:
df2.sort_index(axis = 1, ascending = False) # by axis labels

                   D         C         B         A
2014-01-01  0.411787  1.894806 -1.339152  0.552052
2014-01-02 -0.208119 -0.050643  0.938891 -0.698046
2014-01-03  0.247181 -0.226546 -0.391723  0.578617
2014-01-04 -0.526755  0.694883 -1.102670  0.249337
2014-01-05 -1.000748 -0.913080 -1.067379 -1.323987
2014-01-06  0.585470 -0.193535  0.259838 -1.309757

In [14]:
print df2.sort_index(by = 'B') # by values
df2.sort(columns = 'B') # by values

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-04  0.249337 -1.102670  0.694883 -0.526755
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-06 -1.309757  0.259838 -0.193535  0.585470
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-04  0.249337 -1.102670  0.694883 -0.526755
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-06 -1.309757  0.259838 -0.193535  0.585470
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119

## Rank - rank of each element in its row/column

In [15]:
df2.rank(axis = 1)

            A  B  C  D
2014-01-01  3  1  4  2
2014-01-02  1  4  3  2
2014-01-03  4  1  2  3
2014-01-04  3  1  4  2
2014-01-05  1  2  4  3
2014-01-06  1  3  2  4

## Selection and setting

.loc is primarily label based, but may also be used with a boolean array. 

.iloc is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array. 

.ix supports mixed integer and label based access. It is primarily label based, but will fall back to integer positional access unless the corresponding axis is of integer type. .

In [16]:
df2['A'] # by column names
df2.A

2014-01-01    0.552052
2014-01-02   -0.698046
2014-01-03    0.578617
2014-01-04    0.249337
2014-01-05   -1.323987
2014-01-06   -1.309757
Freq: D, Name: A, dtype: float64

In [17]:
df2[0:4] # by row 
df2.loc[dates[0:4]] # by label
df2['20140101':'20140104'] 
# by label: not python indexing..., the last ind is included

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-04  0.249337 -1.102670  0.694883 -0.526755

In [18]:
# by position
df2.iloc[0:2, 2:4]

                   C         D
2014-01-01  1.894806  0.411787
2014-01-02 -0.050643 -0.208119

In [19]:
# Boolean
df2[df2.A > 0]

                   A         B         C         D
2014-01-01  0.552052 -1.339152  1.894806  0.411787
2014-01-03  0.578617 -0.391723 -0.226546  0.247181
2014-01-04  0.249337 -1.102670  0.694883 -0.526755

In [20]:
df2[df2 > 0]

                   A         B         C         D
2014-01-01  0.552052       NaN  1.894806  0.411787
2014-01-02       NaN  0.938891       NaN       NaN
2014-01-03  0.578617       NaN       NaN  0.247181
2014-01-04  0.249337       NaN  0.694883       NaN
2014-01-05       NaN       NaN       NaN       NaN
2014-01-06       NaN  0.259838       NaN  0.585470

In [21]:
df = df2.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2014-01-01  0.552052 -1.339152  1.894806  0.411787    one
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119    one
2014-01-03  0.578617 -0.391723 -0.226546  0.247181    two
2014-01-04  0.249337 -1.102670  0.694883 -0.526755  three
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748   four
2014-01-06 -1.309757  0.259838 -0.193535  0.585470  three

In [22]:
# filter by value
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2014-01-03  0.578617 -0.391723 -0.226546  0.247181   two
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748  four

In [23]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20140102', periods = 6))
s1

2014-01-02    1
2014-01-03    2
2014-01-04    3
2014-01-05    4
2014-01-06    5
2014-01-07    6
Freq: D, dtype: int64

In [24]:
# setting a new column automatically aligns the data by indices
df['F'] = s1
df

                   A         B         C         D   F
2014-01-01  0.552052 -1.339152  1.894806  0.411787 NaN
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119   1
2014-01-03  0.578617 -0.391723 -0.226546  0.247181   2
2014-01-04  0.249337 -1.102670  0.694883 -0.526755   3
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748   4
2014-01-06 -1.309757  0.259838 -0.193535  0.585470   5

In [25]:
# setting data by position
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D   F
2014-01-01  0.000000 -1.339152  1.894806  0.411787 NaN
2014-01-02 -0.698046  0.938891 -0.050643 -0.208119   1
2014-01-03  0.578617 -0.391723 -0.226546  0.247181   2
2014-01-04  0.249337 -1.102670  0.694883 -0.526755   3
2014-01-05 -1.323987 -1.067379 -0.913080 -1.000748   4
2014-01-06 -1.309757  0.259838 -0.193535  0.585470   5

In [26]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2014-01-01  0.000000 -1.339152  1.894806  5 NaN
2014-01-02 -0.698046  0.938891 -0.050643  5   1
2014-01-03  0.578617 -0.391723 -0.226546  5   2
2014-01-04  0.249337 -1.102670  0.694883  5   3
2014-01-05 -1.323987 -1.067379 -0.913080  5   4
2014-01-06 -1.309757  0.259838 -0.193535  5   5

In [27]:
# .ix is like R's selection
df.ix[0:2, 'A']

2014-01-01    0.000000
2014-01-02   -0.698046
Freq: D, Name: A, dtype: float64

## Missing data

In [28]:
df

                   A         B         C  D   F
2014-01-01  0.000000 -1.339152  1.894806  5 NaN
2014-01-02 -0.698046  0.938891 -0.050643  5   1
2014-01-03  0.578617 -0.391723 -0.226546  5   2
2014-01-04  0.249337 -1.102670  0.694883  5   3
2014-01-05 -1.323987 -1.067379 -0.913080  5   4
2014-01-06 -1.309757  0.259838 -0.193535  5   5

In [29]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[1]:dates[1], 'E'] = 1
df1

                   A         B         C  D   F   E
2014-01-01  0.000000 -1.339152  1.894806  5 NaN NaN
2014-01-02 -0.698046  0.938891 -0.050643  5   1   1
2014-01-03  0.578617 -0.391723 -0.226546  5   2 NaN
2014-01-04  0.249337 -1.102670  0.694883  5   3 NaN

In [30]:
# drop any rows with NA
df1.dropna(how = 'any')

                   A         B         C  D  F  E
2014-01-02 -0.698046  0.938891 -0.050643  5  1  1

In [31]:
# fill NA
df1.fillna(value = 5)

                   A         B         C  D  F  E
2014-01-01  0.000000 -1.339152  1.894806  5  5  5
2014-01-02 -0.698046  0.938891 -0.050643  5  1  1
2014-01-03  0.578617 -0.391723 -0.226546  5  2  5
2014-01-04  0.249337 -1.102670  0.694883  5  3  5

In [32]:
# boolean mask of na
pd.isnull(df1)

                A      B      C      D      F      E
2014-01-01  False  False  False  False   True   True
2014-01-02  False  False  False  False  False  False
2014-01-03  False  False  False  False  False   True
2014-01-04  False  False  False  False  False   True

In [33]:
df1.dropna(thresh = 5)

                   A         B         C  D  F   E
2014-01-02 -0.698046  0.938891 -0.050643  5  1   1
2014-01-03  0.578617 -0.391723 -0.226546  5  2 NaN
2014-01-04  0.249337 -1.102670  0.694883  5  3 NaN

# Opearations

## Stats - generally exclude NA by default

In [34]:
print df
df.mean(axis = 1)

                   A         B         C  D   F
2014-01-01  0.000000 -1.339152  1.894806  5 NaN
2014-01-02 -0.698046  0.938891 -0.050643  5   1
2014-01-03  0.578617 -0.391723 -0.226546  5   2
2014-01-04  0.249337 -1.102670  0.694883  5   3
2014-01-05 -1.323987 -1.067379 -0.913080  5   4
2014-01-06 -1.309757  0.259838 -0.193535  5   5

2014-01-01    1.388914
2014-01-02    1.238040
2014-01-03    1.392070
2014-01-04    1.568310
2014-01-05    1.139111
2014-01-06    1.751309
Freq: D, dtype: float64

In [35]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2014-01-01   NaN
2014-01-02   NaN
2014-01-03     1
2014-01-04     3
2014-01-05     5
2014-01-06   NaN
Freq: D, dtype: float64

In [36]:
# subtract a Series from a Frame: automatically broadcast
df.sub(s, axis = 'index')

                   A         B         C   D   F
2014-01-01       NaN       NaN       NaN NaN NaN
2014-01-02       NaN       NaN       NaN NaN NaN
2014-01-03 -0.421383 -1.391723 -1.226546   4   1
2014-01-04 -2.750663 -4.102670 -2.305117   2   0
2014-01-05 -6.323987 -6.067379 -5.913080   0  -1
2014-01-06       NaN       NaN       NaN NaN NaN

1. argmin, argmax: index location of min/max
1. idxmin, idxmax: index values of min/max
1. pct_change: percent changes

In [64]:
df.pct_change()

           0          1          2          3
0        NaN        NaN        NaN        NaN
1  17.340287  -3.631686  -1.527806   1.675795
2  -1.348509  -0.603981  -6.101802  -1.090901
3   2.394562  -0.653166  -1.024189  11.853774
4  -0.932968  -1.013099 -35.195460  -0.734993
5  46.602180  19.866025  -2.252444  -0.926345
6  -0.698410   6.738657  -1.190113  17.726514
7  -1.909594  -2.646584   0.869592  -1.967516
8  -0.602511  -1.856983  -4.903110  -2.585691
9   5.665212  -1.066515  -0.804322  -0.906508

In [ ]:
#correlation, covariance
df2.corr()

In [ ]:
df2.corrwith(df2.A)

In [ ]:
df2

In [ ]:
df2.corr().isin([1])

## Apply (col or row), Applymap (element-wise), map (for series)

In [ ]:
# apply function along specified axis of frame
df.apply(np.cumsum, axis = 1)

## Histogramming

In [ ]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

In [ ]:
s.value_counts()

## String Methods

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
print s
s.str.lower()

# Merge

## Concat / Intersect / combine with NaN filling

In [60]:
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.041334 -0.772922  0.529117  0.539917
 1 -0.758075  2.034088 -0.279271  1.444706
 2  0.264196  0.805537  1.424786 -0.131326,
           0         1         2         3
 3  0.896831  0.279387 -0.034465 -1.688032
 4  0.060117 -0.003660  1.178538 -0.447340
 5  2.861680 -0.076362 -1.476053 -0.032949
 6  0.863054 -0.590937  0.280617 -0.617019,
           0         1         2         3
 7 -0.785029  0.973027  0.524639  0.596976
 8 -0.312040 -0.833868 -2.047722 -0.946620
 9 -2.079814  0.055464 -0.400693 -0.088502]

In [43]:

pd.concat(pieces)

          0         1         2         3
0 -0.095722 -0.318699 -1.565286  1.487514
1 -0.282228 -1.928746  1.017282 -0.216777
2 -0.736848  0.353567  0.071673 -0.215898
3  0.145845  1.788257  0.843018  0.890737
4 -0.942070  0.286443  1.600361 -0.750786
5 -0.697249 -1.315938 -2.064965  0.308894
6  1.146851  0.883578  1.969243  0.256813
7  0.931635 -1.739227 -0.347588  0.535940
8  0.113310  0.793846 -1.120285  0.879548
9  0.403197 -1.116450 -0.196104 -0.787861

In [63]:
pieces[1] = pieces[1].rename(columns = {1: 11})
pd.concat(pieces, join = 'inner')

          0         2         3
0 -0.041334  0.529117  0.539917
1 -0.758075 -0.279271  1.444706
2  0.264196  1.424786 -0.131326
3  0.896831 -0.034465 -1.688032
4  0.060117  1.178538 -0.447340
5  2.861680 -1.476053 -0.032949
6  0.863054  0.280617 -0.617019
7 -0.785029  0.524639  0.596976
8 -0.312040 -2.047722 -0.946620
9 -2.079814 -0.400693 -0.088502

In [71]:
pieces[1].iloc[1, 0] = np.nan

In [74]:
pieces

[          0         1         2         3
 0 -0.041334 -0.772922  0.529117  0.539917
 1 -0.758075  2.034088 -0.279271  1.444706
 2  0.264196  0.805537  1.424786 -0.131326,
          0         11        2         3
 3  0.896831  0.279387 -0.034465 -1.688032
 4       NaN       NaN  1.178538 -0.447340
 5  2.861680 -0.076362 -1.476053 -0.032949
 6  0.863054 -0.590937  0.280617 -0.617019,
           0         1         2         3
 7 -0.785029  0.973027  0.524639  0.596976
 8 -0.312040 -0.833868 -2.047722 -0.946620
 9 -2.079814  0.055464 -0.400693 -0.088502]

In [81]:
pieces[1].reset_index(drop = True).combine_first(pieces[0])

         0         1         2         3         11
0  0.896831 -0.772922 -0.034465 -1.688032  0.279387
1 -0.758075  2.034088  1.178538 -0.447340       NaN
2  2.861680  0.805537 -1.476053 -0.032949 -0.076362
3  0.863054       NaN  0.280617 -0.617019 -0.590937

## Join/Merge

by default the join is inner

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
print left
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
print right
pd.merge(left, right, on = 'key')

## Append

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

In [ ]:
s = df.iloc[3]
s

In [ ]:
df.append(s, ignore_index = True)

## Grouping

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

In [ ]:
df.groupby('A').sum()

In [ ]:
df.groupby(['A', 'B']).sum()

# Reshaping

## Stack (compresses a level in DF's columns), multilevel index

In [82]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [83]:
index = pd.MultiIndex.from_tuples(tuples, 
                                  names = ['first', 'second'])
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [84]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns = ['A', 'B'])
df

                     A         B
first second
bar   one     0.306013  1.255840
      two    -0.197295  0.913461
baz   one     0.765388  0.811382
      two    -0.382991 -0.402895
foo   one    -0.506141 -0.436941
      two    -1.430893  0.120281
qux   one     1.494867 -1.378650
      two    -0.472516 -0.235794

In [85]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.306013  1.255840
      two    -0.197295  0.913461
baz   one     0.765388  0.811382
      two    -0.382991 -0.402895

In [86]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.306013
               B    1.255840
       two     A   -0.197295
               B    0.913461
baz    one     A    0.765388
               B    0.811382
       two     A   -0.382991
               B   -0.402895
dtype: float64

In [87]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.306013  0.765388
       B  1.255840  0.811382
two    A -0.197295 -0.382991
       B  0.913461 -0.402895

## Pivot Tables: convert row to col/col to row

In [88]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
'B' : ['A', 'B', 'C'] * 4,
'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
'D' : np.random.randn(12),
'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.497203 -0.870454
1     one  B  foo  0.389975  0.895622
2     two  C  foo -0.206902 -0.562737
3   three  A  bar  1.240001  0.912450
4     one  B  bar  1.188392  0.493197
5     one  C  bar -0.596450 -0.521180
6     two  A  foo -0.861538 -0.321827
7   three  B  foo -0.019569 -0.344544
8     one  C  foo -0.317591  0.086169
9     one  A  bar  1.243131  1.522866
10    two  B  bar  1.779272  1.092390
11  three  C  bar  0.297339  0.657651

In [89]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  1.243131 -0.497203
      B  1.188392  0.389975
      C -0.596450 -0.317591
three A  1.240001       NaN
      B       NaN -0.019569
      C  0.297339       NaN
two   A       NaN -0.861538
      B  1.779272       NaN
      C       NaN -0.206902

### set_index: convert row to column

In [140]:
df2 = df.set_index(['A', 'B', 'C'])
print df2
df3 = df2.unstack('C').drop('E', axis = 1)
df3

                    D         E
A     B C
one   A foo -0.497203 -0.870454
      B foo  0.389975  0.895622
two   C foo -0.206902 -0.562737
three A bar  1.240001  0.912450
one   B bar  1.188392  0.493197
      C bar -0.596450 -0.521180
two   A foo -0.861538 -0.321827
three B foo -0.019569 -0.344544
one   C foo -0.317591  0.086169
      A bar  1.243131  1.522866
two   B bar  1.779272  1.092390
three C bar  0.297339  0.657651

                D
C             bar       foo
A     B
one   A  1.243131 -0.497203
      B  1.188392  0.389975
      C -0.596450 -0.317591
three A  1.240001       NaN
      B       NaN -0.019569
      C  0.297339       NaN
two   A       NaN -0.861538
      B  1.779272       NaN
      C       NaN -0.206902

In [147]:
pd.melt(df, id_vars = ['A', 'B', 'C'])

        A  B    C variable     value
0     one  A  foo        D -0.497203
1     one  B  foo        D  0.389975
2     two  C  foo        D -0.206902
3   three  A  bar        D  1.240001
4     one  B  bar        D  1.188392
5     one  C  bar        D -0.596450
6     two  A  foo        D -0.861538
7   three  B  foo        D -0.019569
8     one  C  foo        D -0.317591
9     one  A  bar        D  1.243131
10    two  B  bar        D  1.779272
11  three  C  bar        D  0.297339
12    one  A  foo        E -0.870454
13    one  B  foo        E  0.895622
14    two  C  foo        E -0.562737
15  three  A  bar        E  0.912450
16    one  B  bar        E  0.493197
17    one  C  bar        E -0.521180
18    two  A  foo        E -0.321827
19  three  B  foo        E -0.344544
20    one  C  foo        E  0.086169
21    one  A  bar        E  1.522866
22    two  B  bar        E  1.092390
23  three  C  bar        E  0.657651

## Reset Index - convert index to a column

In [146]:
print df
df.reset_index(drop = True)

        A  B    C         D         E
0     one  A  foo -0.497203 -0.870454
1     one  B  foo  0.389975  0.895622
2     two  C  foo -0.206902 -0.562737
3   three  A  bar  1.240001  0.912450
4     one  B  bar  1.188392  0.493197
5     one  C  bar -0.596450 -0.521180
6     two  A  foo -0.861538 -0.321827
7   three  B  foo -0.019569 -0.344544
8     one  C  foo -0.317591  0.086169
9     one  A  bar  1.243131  1.522866
10    two  B  bar  1.779272  1.092390
11  three  C  bar  0.297339  0.657651

        A  B    C         D         E
0     one  A  foo -0.497203 -0.870454
1     one  B  foo  0.389975  0.895622
2     two  C  foo -0.206902 -0.562737
3   three  A  bar  1.240001  0.912450
4     one  B  bar  1.188392  0.493197
5     one  C  bar -0.596450 -0.521180
6     two  A  foo -0.861538 -0.321827
7   three  B  foo -0.019569 -0.344544
8     one  C  foo -0.317591  0.086169
9     one  A  bar  1.243131  1.522866
10    two  B  bar  1.779272  1.092390
11  three  C  bar  0.297339  0.657651

# Time Series

## frequency conversion (like second to minite data)

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

In [ ]:
ts.resample('5Min', how = 'sum')

## Time zone representation

In [ ]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')
ts_utc

In [ ]:
#convert to another time zone
ts_utc.tz_convert('US/Eastern')

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
# time span conversion
ps = ts.to_period()
ps

In [ ]:
ps.to_timestamp()

# Plotting

In [ ]:
ts = pd.Series(np.random.randn(1000), 
               index=pd.date_range('1/1/2000', periods=1000))

In [ ]:
ts = ts.cumsum()
ts.plot()

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4),
index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure()
df.plot()

# I/O

In [ ]:
df.to_csv('foo.csv')

In [ ]:
ls

In [ ]:
aa = pd.read_csv('foo.csv')
aa

## Excel

In [ ]:
df.to_excel('foo.xlsx', sheet_name = 'Sheet1')

In [ ]:

pd.read_excel('foo.xlsx', 'Sheet1', index_col = None, na_values = ['NA'])

## Filtering/Sampling

In [6]:
ddff = pd.DataFrame(np.random.randn(10,3))
print ddff
print ddff[(ddff > 1).any(1)] # get any line with elements > 1

          0         1         2
0 -0.201883  0.212899  0.908256
1 -0.167004 -0.607268 -0.244057
2 -2.032865  1.208505  1.658248
3 -0.222002  1.525824 -1.495721
4 -1.476540  1.125183 -0.618756
5 -1.076687 -0.795009  1.156377
6  0.035613  0.749159  0.077703
7  0.212349  0.508544  0.357414
8  0.775127  0.308759  0.660430
9 -0.525249  0.021875 -0.680428
          0         1         2
2 -2.032865  1.208505  1.658248
3 -0.222002  1.525824 -1.495721
4 -1.476540  1.125183 -0.618756
5 -1.076687 -0.795009  1.156377

In [7]:
ddff.take(np.random.permutation(len(ddff)))

          0         1         2
8  0.775127  0.308759  0.660430
6  0.035613  0.749159  0.077703
7  0.212349  0.508544  0.357414
1 -0.167004 -0.607268 -0.244057
0 -0.201883  0.212899  0.908256
3 -0.222002  1.525824 -1.495721
4 -1.476540  1.125183 -0.618756
9 -0.525249  0.021875 -0.680428
5 -1.076687 -0.795009  1.156377
2 -2.032865  1.208505  1.658248

## Dummy variable and BIN

In [16]:
bins = np.arange(-3, 3, 1)
pd.get_dummies(pd.cut(ddff[0], bins, labels = ['tiny', 'pitty', 'poor', 'okay', 'see']))

   tiny  pitty  poor  okay  see
0     0      0     1     0    0
1     0      0     1     0    0
2     1      0     0     0    0
3     0      0     1     0    0
4     0      1     0     0    0
5     0      1     0     0    0
6     0      0     0     1    0
7     0      0     0     1    0
8     0      0     0     1    0
9     0      0     1     0    0